cf/Catalogs/ЛогистическиеСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЛогистическиеСпецификации</Name>
			<Comment>neti Муталлапова 26.04.2017</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Импорт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособДоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Растаможка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяЗабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СанктПетербург</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Москва</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НижнийНовгород</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мурманск</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Новокузнецк</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хабаровск</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнегоИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ЛогистическиеСпецификации/Ext/ManagerModule.bsl
Функция ПеренестиДанныеВЛогистическуюСпецификацию(ДанныеСпецификации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛогистическиеСпецификацииСостав.Ссылка,
	|	ЛогистическиеСпецификацииСостав.НомерСтроки,
	|	ЛогистическиеСпецификацииСостав.Поставщик,
	|	ЛогистическиеСпецификацииСостав.Импорт,
	|	ЛогистическиеСпецификацииСостав.СпособДоставки,
	|	ЛогистическиеСпецификацииСостав.Растаможка,
	|	ЛогистическиеСпецификацииСостав.ВремяЗабора,
	|	ЛогистическиеСпецификацииСостав.СанктПетербург,
	|	ЛогистическиеСпецификацииСостав.Москва,
	|	ЛогистическиеСпецификацииСостав.НижнийНовгород,
	|	ЛогистическиеСпецификацииСостав.Мурманск,
	|	ЛогистическиеСпецификацииСостав.Новокузнецк,
	|	ЛогистическиеСпецификацииСостав.Хабаровск,
	|	ЛогистическиеСпецификацииСостав.Автор,
	|	ЛогистическиеСпецификацииСостав.ДатаПоследнегоИзменения
	|ИЗ
	|	Справочник.ЛогистическиеСпецификации.Состав КАК ЛогистическиеСпецификацииСостав
	|ГДЕ
	|	ЛогистическиеСпецификацииСостав.Поставщик = &Поставщик
	|	И ЛогистическиеСпецификацииСостав.СпособДоставки = &СпособДоставки
	|	И НЕ ЛогистическиеСпецификацииСостав.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛогистическиеСпецификацииСостав.Ссылка,
	|	ЛогистическиеСпецификацииСостав.НомерСтроки,
	|	ЛогистическиеСпецификацииСостав.Поставщик,
	|	ЛогистическиеСпецификацииСостав.Импорт,
	|	ЛогистическиеСпецификацииСостав.СпособДоставки,
	|	ЛогистическиеСпецификацииСостав.Растаможка,
	|	ЛогистическиеСпецификацииСостав.ВремяЗабора,
	|	ЛогистическиеСпецификацииСостав.СанктПетербург,
	|	ЛогистическиеСпецификацииСостав.Москва,
	|	ЛогистическиеСпецификацииСостав.НижнийНовгород,
	|	ЛогистическиеСпецификацииСостав.Мурманск,
	|	ЛогистическиеСпецификацииСостав.Новокузнецк,
	|	ЛогистическиеСпецификацииСостав.Хабаровск,
	|	ЛогистическиеСпецификацииСостав.Автор,
	|	ЛогистическиеСпецификацииСостав.ДатаПоследнегоИзменения
	|ИЗ
	|	Справочник.ЛогистическиеСпецификации.Состав КАК ЛогистическиеСпецификацииСостав
	|ГДЕ
	|	ЛогистическиеСпецификацииСостав.Поставщик = &Поставщик
	|	И НЕ ЛогистическиеСпецификацииСостав.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛогистическиеСпецификации.Ссылка
	|ИЗ
	|	Справочник.ЛогистическиеСпецификации КАК ЛогистическиеСпецификации
	|ГДЕ
	|	НЕ ЛогистическиеСпецификации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Поставщик", ДанныеСпецификации.Поставщик);
	Запрос.УстановитьПараметр("СпособДоставки", ДанныеСпецификации.СпособДоставки);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Выборка1 = Результаты[0].Выбрать();
	Выборка2 = Результаты[1].Выбрать();
	Выборка3 = Результаты[2].Выбрать();
	
	Если Выборка1.Следующий() Тогда
		
		ЛогСпецификацияОбъект = Выборка1.Ссылка.ПолучитьОбъект();
		СтрокиСпецификации = ЛогСпецификацияОбъект.Состав.НайтиСтроки(Новый Структура("Поставщик,СпособДоставки", ДанныеСпецификации.Поставщик, ДанныеСпецификации.СпособДоставки));
		
		Если СтрокиСпецификации.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокиСпецификации[0], ДанныеСпецификации);
			ЛогСпецификацияОбъект.Записать();
		КонецЕсли;
		
	ИначеЕсли Выборка2.Следующий() Тогда  
		
		ЛогСпецификацияОбъект = Выборка2.Ссылка.ПолучитьОбъект();
		СтрокаСпецификации = ЛогСпецификацияОбъект.Состав.Найти(ДанныеСпецификации.Поставщик, "Поставщик");
		ЗаполнитьЗначенияСвойств(СтрокаСпецификации, ДанныеСпецификации);
		ЛогСпецификацияОбъект.Записать();
		
	ИначеЕсли Выборка3.Следующий() Тогда 
		
		ЛогСпецификацияОбъект = Выборка3.Ссылка.ПолучитьОбъект();
		СтрокаСпецификации = ЛогСпецификацияОбъект.Состав.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСпецификации, ДанныеСпецификации);
		ЛогСпецификацияОбъект.Записать();
		
	Иначе 
		
		ЛогСпецификацияОбъект = Справочники.ЛогистическиеСпецификации.СоздатьЭлемент();
		НоваяСтрока = ЛогСпецификацияОбъект.Состав.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСпецификации);
		ЛогСпецификацияОбъект.Наименование = "Логистическая спецификация";
		ЛогСпецификацияОбъект.Записать();
		
	КонецЕсли;	
	
	Возврат ЛогСпецификацияОбъект.Ссылка;
	
КонецФункции
